# SQL Practice

The dataset and exercises are from [kiwidamien repository](https://github.com/kiwidamien/SQL_practice)

In [2]:
import pandas as pd
from pandasql import sqldf
import sqlite3
import math

In [3]:
pysqldf = lambda q: sqldf(q, globals())

## 1. Seattle Weather

In [5]:
weather = pd.read_csv("01_seattle_weather/cleaned_weather.csv")
conn_1 = sqlite3.connect(":memory:")
weather.to_sql('weather', conn_1, index=False)

25548

**1. Select all rows from December 1st, 2000 to December 15th, 2000 (inclusive)**

In [7]:
query = """
SELECT *
FROM weather
WHERE DATE >= "2000-12-01"
AND DATE <= "2000-12-15"
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

          DATE  PRCP  TMAX  TMIN  RAIN
0   2000-12-01  0.04    55    39     1
1   2000-12-02  0.18    51    37     1
2   2000-12-03  0.00    44    34     0
3   2000-12-04  0.00    51    37     0
4   2000-12-05  0.00    50    36     0
5   2000-12-06  0.00    50    35     0
6   2000-12-07  0.00    40    34     0
7   2000-12-08  0.02    45    30     1
8   2000-12-09  0.06    43    36     1
9   2000-12-10  0.00    40    30     0
10  2000-12-11  0.00    37    28     0
11  2000-12-12  0.00    37    28     0
12  2000-12-13  0.00    37    30     0
13  2000-12-14  0.26    46    28     1
14  2000-12-15  0.00    42    35     0

**2. Get the average maximum temperature for every year from the year 2000 onward. Order the results by year (ascending)**

In [9]:
query = """
SELECT STRFTIME('%Y', DATE) AS YEAR,
AVG(TMAX)
FROM weather
GROUP BY YEAR
HAVING YEAR >= "2000"
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

    YEAR  AVG(TMAX)
0   2000  58.674863
1   2001  58.473973
2   2002  58.893151
3   2003  60.441096
4   2004  60.622951
5   2005  60.148352
6   2006  61.038356
7   2007  59.202740
8   2008  58.494536
9   2009  59.912329
10  2010  59.663014
11  2011  58.139726
12  2012  59.502732
13  2013  60.901370
14  2014  62.594521
15  2015  63.369863
16  2016  62.546448
17  2017  61.727011

**3 Get the standard deviation of the maximum temperature per year, from 2000 onward. Order by year (ascending)**

In [11]:
conn_1.create_function("SQRT", 1, math.sqrt)

In [12]:
query = """
SELECT 
    STRFTIME('%Y', DATE) AS YEAR,
    AVG(TMAX) AS mean_TMAX,
    AVG(TMAX * TMAX) - AVG(TMAX) * AVG(TMAX) AS variance_TMAX,
    SQRT(AVG(TMAX * TMAX) - AVG(TMAX) * AVG(TMAX)) AS standard_deviation_TMAX
FROM weather
GROUP BY YEAR
HAVING YEAR >= "2000"
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

    YEAR  mean_TMAX  variance_TMAX  standard_deviation_TMAX
0   2000  58.674863     131.574614                11.470598
1   2001  58.473973     124.545213                11.159983
2   2002  58.893151     151.026939                12.289302
3   2003  60.441096     165.238311                12.854505
4   2004  60.622951     158.606468                12.593906
5   2005  60.148352     141.054915                11.876654
6   2006  61.038356     169.790310                13.030361
7   2007  59.202740     166.391773                12.899294
8   2008  58.494536     168.463085                12.979333
9   2009  59.912329     202.019711                14.213364
10  2010  59.663014     124.196029                11.144327
11  2011  58.139726     154.635271                12.435243
12  2012  59.502732     161.954911                12.726151
13  2013  60.901370     184.516299                13.583678
14  2014  62.594521     170.723258                13.066111
15  2015  63.369863     173.285119                13.163781
16  2016  62.546448     159.619427                12.634058
17  2017  61.727011     200.928351                14.174920

**4. What are the 10 hottest days on record? Take hottest to mean 'highest maximum temperature'**

In [14]:
query = """
SELECT *
FROM weather
ORDER BY TMAX DESC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

         DATE  PRCP  TMAX  TMIN  RAIN
0  2009-07-29   0.0   103    71     0
1  1994-07-20   0.0   100    65     0
2  1960-08-09   0.0    99    59     0
3  1981-08-09   0.0    99    68     0
4  1991-07-23   0.0    99    65     0
5  1960-08-08   0.0    98    66     0
6  1967-08-16   0.0    98    59     0
7  1979-07-16   0.0    98    63     0
8  1981-08-10   0.0    98    67     0
9  1988-09-02   0.0    98    59     0

**5. In 2016, what fraction of days did it rain?**

In [16]:
query = """
SELECT AVG(RAIN) AS rain_fraction_2016
FROM weather
WHERE DATE >= "2016-01-01"
AND DATE <= "2016-12-31"
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

   rain_fraction_2016
0            0.469945

**6. What is the 75th percentile for the amount of rain that fell on a day where there was some rain in 2016?**

In [18]:
query = """
SELECT PRCP
FROM (
    SELECT PRCP
    FROM weather
    WHERE 
        PRCP > 0 AND
        STRFTIME('%Y', DATE) = '2016'
    ORDER BY PRCP
    LIMIT 1 OFFSET (
        (SELECT COUNT(*) * 0.75 
         FROM weather
         WHERE PRCP > 0 AND STRFTIME('%Y', DATE) = '2016')
    )
) AS sub
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

   PRCP
0  0.33

**7. What is the 75th percentile for the amount of rain that fell on any day in 2016?**

In [20]:
query = """
SELECT PRCP
    FROM weather
    WHERE 
        STRFTIME('%Y', DATE) = '2016'
    ORDER BY PRCP
    LIMIT 1 OFFSET ROUND((SELECT COUNT(*) * 0.75 
         FROM weather
         WHERE STRFTIME('%Y', DATE) = '2016'))
    
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

   PRCP
0  0.15

**8. Get the 10 years with the hottest average maximum temperature in July. Order from hottest to coolest**

In [22]:
query = """
SELECT 
    STRFTIME('%Y', DATE) AS YEAR,
    AVG(TMAX) AS avg_july_high_temp
FROM weather   
WHERE STRFTIME('%m', DATE) = "07"
GROUP BY YEAR
ORDER BY avg_july_high_temp DESC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

   YEAR  avg_july_high_temp
0  2015           82.580645
1  1958           81.419355
2  2009           80.967742
3  1985           80.935484
4  2014           80.419355
5  1960           79.645161
6  1965           79.451613
7  1990           79.193548
8  2013           78.967742
9  2003           78.967742

**9. Get the 10 years with the coldest average minimum temperature in December. Order from coolest to hottest**

In [24]:
query = """
SELECT 
    STRFTIME('%Y', DATE) AS YEAR,
    AVG(TMIN) AS avg_dec_min_temp
FROM weather   
WHERE STRFTIME('%m', DATE) = "12"
GROUP BY YEAR
ORDER BY avg_dec_min_temp ASC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

   YEAR  avg_dec_min_temp
0  1990         30.387097
1  1948         30.806452
2  1985         30.935484
3  1951         31.225806
4  1964         31.483871
5  1983         31.516129
6  1968         32.032258
7  1984         32.096774
8  2009         32.096774
9  1978         32.161290

**10. Repeat the last question, but round the temperatures to 3 decimal places**

In [26]:
query = """
SELECT 
    STRFTIME('%Y', DATE) AS YEAR,
    ROUND(AVG(TMIN), 3) AS avg_dec_min_temp
FROM weather   
WHERE STRFTIME('%m', DATE) = "12"
GROUP BY YEAR
ORDER BY avg_dec_min_temp ASC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

   YEAR  avg_dec_min_temp
0  1990            30.387
1  1948            30.806
2  1985            30.935
3  1951            31.226
4  1964            31.484
5  1983            31.516
6  1968            32.032
7  1984            32.097
8  2009            32.097
9  1978            32.161

**11. Give the average inches of rain that fell per day for each month, where the average is taken over 2000 - 2010 (inclusive)**

In [28]:
query = """
SELECT
    STRFTIME('%m', DATE) AS month,
    AVG(PRCP) as avg_daily_inches_rain
FROM weather
WHERE STRFTIME('%Y', DATE) >= "2000" AND STRFTIME('%Y', DATE) <= "2010"
GROUP BY month
ORDER BY month ASC
"""

result =  pd.read_sql_query(query, conn_1)
print(result)

   month  avg_daily_inches_rain
0     01               0.191613
1     02               0.094277
2     03               0.113578
3     04               0.085364
4     05               0.068035
5     06               0.050182
6     07               0.016129
7     08               0.034370
8     09               0.056930
9     10               0.115543
10    11               0.216242
11    12               0.180059

-------

## 2. Employee

In [31]:
department = pd.read_csv("02_employee/department.csv")
employee = pd.read_csv("02_employee/employee_data.csv")

conn_2 = sqlite3.connect(":memory:")

department.to_sql('department', conn_2, index=False)
employee.to_sql('employee', conn_2, index=False)

16

**1. List all the employees in order of descreasing salary**

In [33]:
query = """
SELECT *
FROM employee
ORDER BY salary DESC
"""

result =  pd.read_sql_query(query, conn_2)
print(result)

    emp_id          emp_name  mananger_id  dept_id  salary
0        4     Anthony Stark          NaN        1  100000
1        8             Shuri          NaN        5   80000
2       15      Joe McMillan         13.0        2   80000
3       13      Donna Clarke          NaN        1   75000
4       14      Cameron Howe         13.0        3   75000
5        9   Diane Rawlinson          NaN        1   50000
6       11    Nancy Karrigan          9.0        4   42000
7       12  Kristi Yamaguchi          9.0        4   40000
8       16      Saul Goodman         13.0        6   40000
9       10     Tonya Harding          9.0        4   30000
10       6      Bruce Banner          4.0        5    8000
11       7       Jane Foster          4.0        5    7500
12       1     Micheal Scott          NaN        1    6000
13       2    Dwight Schrute          1.0        2    4000
14       5          Bill Nye          4.0        5    3800
15       3       Jim Halpert          1.0        2    3500

**2. List all the department names, and the number of employees in that department. Order by number of employess in department (greatest to least)**

In [35]:
query = """
SELECT 
    d.deptname,
    d.deptid,
    COUNT(d.deptname)
FROM department AS d
INNER JOIN employee AS e ON d.deptid = e.dept_id
GROUP BY d.deptname
ORDER BY COUNT(d.deptname) DESC

"""

result =  pd.read_sql_query(query, conn_2)
print(result)

   deptname  deptid  COUNT(d.deptname)
0  Research       5                  4
1     Admin       1                  4
2  Training       4                  3
3     Sales       2                  3
4     Legal       6                  1
5        IT       3                  1

**3. List all the employees that don't have a manager**

In [37]:
query = """
SELECT *
FROM employee
WHERE mananger_id IS NULL
"""

result =  pd.read_sql_query(query, conn_2)
print(result)

   emp_id         emp_name mananger_id  dept_id  salary
0       1    Micheal Scott        None        1    6000
1       4    Anthony Stark        None        1  100000
2       8            Shuri        None        5   80000
3       9  Diane Rawlinson        None        1   50000
4      13     Donna Clarke        None        1   75000

**4. List all employees by name, and the name of their manager. If the employee doesn't have a manager, leave the column as NULL.**

In [39]:
query = """
SELECT 
    e1.emp_name AS employee_name,
    e2.emp_name AS manager_name
FROM employee AS e1
LEFT JOIN employee AS e2 ON e1.mananger_id = e2.emp_id
ORDER by manager_name DESC
"""

result =  pd.read_sql_query(query, conn_2)
print(result)

       employee_name     manager_name
0     Dwight Schrute    Micheal Scott
1        Jim Halpert    Micheal Scott
2       Cameron Howe     Donna Clarke
3       Joe McMillan     Donna Clarke
4       Saul Goodman     Donna Clarke
5      Tonya Harding  Diane Rawlinson
6     Nancy Karrigan  Diane Rawlinson
7   Kristi Yamaguchi  Diane Rawlinson
8           Bill Nye    Anthony Stark
9       Bruce Banner    Anthony Stark
10       Jane Foster    Anthony Stark
11     Micheal Scott             None
12     Anthony Stark             None
13             Shuri             None
14   Diane Rawlinson             None
15      Donna Clarke             None

**5. For each manager, list the number of employees he or she is managing. For these purposes, a manager is anyone who is not managed by someone else, even if that person has no direct reports.**

In [41]:
query = """
SELECT
    e1.emp_name AS manager_name,
    COUNT(e2.emp_id) AS num_managed
FROM employee AS e1
LEFT JOIN employee as e2 ON e1.emp_id = e2.mananger_id
WHERE e2.mananger_id IS NOT NULL
GROUP BY e1.emp_id, e1.emp_name
ORDER BY num_managed DESC

"""

result =  pd.read_sql_query(query, conn_2)
print(result)

      manager_name  num_managed
0    Anthony Stark            3
1  Diane Rawlinson            3
2     Donna Clarke            3
3    Micheal Scott            2

**6. Find the two highest paid people per department**

In [43]:
query = """

SELECT 
    dept_id,
    emp_name,
    salary,
    salary_rank
FROM (
    SELECT 
        emp_name,
        dept_id,
        salary,
        RANK() OVER (PARTITION BY dept_id ORDER BY salary DESC) AS salary_rank
    FROM employee
) ranked
WHERE 
    salary_rank <= 2
"""

result =  pd.read_sql_query(query, conn_2)
print(result)

   dept_id          emp_name  salary  salary_rank
0        1     Anthony Stark  100000            1
1        1      Donna Clarke   75000            2
2        2      Joe McMillan   80000            1
3        2    Dwight Schrute    4000            2
4        3      Cameron Howe   75000            1
5        4    Nancy Karrigan   42000            1
6        4  Kristi Yamaguchi   40000            2
7        5             Shuri   80000            1
8        5      Bruce Banner    8000            2
9        6      Saul Goodman   40000            1

------

## 3. Social Network

In [46]:
follows = pd.read_csv("03_social_network/follows.csv")
users = pd.read_csv("03_social_network/users.csv")

conn_3 = sqlite3.connect(":memory:")

follows.to_sql('follows', conn_3, index=False)
users.to_sql('users', conn_3, index=False)

9

**1. How many users are there in each house?**

In [48]:
query = """
SELECT
    house,
    count(house) AS Count
FROM users
GROUP BY house
"""

result =  pd.read_sql_query(query, conn_3)
print(result)

        house  Count
0  Gryffindor      4
1  Hufflepuff      1
2   Ravenclaw      2
3   Slytherin      2

**2. List all following links that were created before September 1st, 1993**

In [50]:
query = """
SELECT *
FROM follows
WHERE date < "1993-09-01"
"""

result =  pd.read_sql_query(query, conn_3)
print(result)

   user_id  follows        date
0        2        1  1989-01-01
1        3        1  1993-07-01
2        4        2  1988-08-08
3        4        1  1988-08-08
4        5        6  1986-01-10
5        7        1  1990-02-02

**3. List all rows from the follows table, replacing both user_ids with first name. Hint: it may help to make this a VIEW**

In [52]:
conn_3.execute("""
CREATE VIEW follow_names AS
SELECT 
    u1.first_name AS follower,
    u2.first_name AS followed,
    f.date
FROM 
    follows f
JOIN 
    users u1 ON f.user_id = u1.user_id
JOIN 
    users u2 ON f.follows = u2.user_id;
""")

query = "SELECT * FROM follow_names;"
result = pd.read_sql_query(query, conn_3)

In [53]:
query = """
SELECT * FROM follow_names;
"""

result =  pd.read_sql_query(query, conn_3)
print(result)

    follower  followed        date
0      Harry       Ron  1993-09-01
1        Ron     Harry  1989-01-01
2   Hermonie     Harry  1993-07-01
3        Ron  Hermonie  1994-10-10
4   Hermonie       Ron  1995-03-01
5      Ginny       Ron  1988-08-08
6      Ginny     Harry  1988-08-08
7      Harry     Ginny  1994-04-02
8      Harry     Draco  2000-01-01
9      Draco     Harry  2000-01-02
10     Draco       Tom  1986-01-10
11      Luna     Harry  1990-02-02
12     Harry      Luna  1996-10-01
13     Harry       Cho  1993-09-03
14       Cho     Harry  1995-09-01
15       Cho    Cedric  1995-09-01
16    Cedric       Cho  1996-01-10
17      Luna       Cho  1993-09-01
18  Hermonie    Cedric  1996-05-30
19     Ginny    Cedric  1996-05-30

**4. List all the following links established before September 1st 1993, but this time use the users first names.**

In [55]:
query = """
SELECT * 
FROM follow_names
WHERE date < "1993-09-01"
"""

result =  pd.read_sql_query(query, conn_3)
print(result)

   follower followed        date
0       Ron    Harry  1989-01-01
1  Hermonie    Harry  1993-07-01
2     Ginny      Ron  1988-08-08
3     Ginny    Harry  1988-08-08
4     Draco      Tom  1986-01-10
5      Luna    Harry  1990-02-02

**5. Give a count of how many people followed each user as of 1999-12-31. Give the result in term of "users full name, number of followers".**

In [57]:
query = """
SELECT 
    u.first_name || ' ' || u.last_name AS user_followed_name,
    COUNT(f.follows) AS num_followers
FROM users AS u
JOIN follows AS f ON u.user_id = f.follows
WHERE date <= "1999-12-31"
GROUP BY user_followed_name
ORDER BY u.user_id

"""

result =  pd.read_sql_query(query, conn_3)
print(result)

  user_followed_name  num_followers
0       Harry Potter              5
1         Ron Wesley              3
2   Hermonie Granger              1
3      Ginny Weasley              1
4         Tom Riddle              1
5      Luna Lovegood              1
6          Cho Chang              3
7     Cedric Diggory              3

**6. List the number of users each user follows**

In [59]:
query = """
SELECT 
    u.first_name || ' ' || u.last_name AS user_followed_name,
    COUNT(f.user_id) AS num_followed
FROM users AS u
JOIN follows AS f ON u.user_id = f.user_id
GROUP BY user_followed_name
ORDER BY u.user_id

"""

result =  pd.read_sql_query(query, conn_3)
print(result)

  user_followed_name  num_followed
0       Harry Potter             5
1         Ron Wesley             2
2   Hermonie Granger             3
3      Ginny Weasley             3
4       Draco Malfoy             2
5      Luna Lovegood             2
6          Cho Chang             2
7     Cedric Diggory             1

**7. List all rows from follows where someone from one house follows someone from a different house.**

In [61]:
query = """
SELECT 
    u.first_name || ' ' || u.last_name AS username,
    u.house AS user_house,
    u2.first_name || ' ' || u2.last_name AS follow_name,
    u2.house AS follows_house
FROM users AS u
JOIN follows AS f ON u.user_id = f.user_id
JOIN users AS u2 ON f.follows = u2.user_id
WHERE u.house != u2.house
"""

result =  pd.read_sql_query(query, conn_3)
print(result)

           username  user_house     follow_name follows_house
0      Harry Potter  Gryffindor    Draco Malfoy     Slytherin
1      Harry Potter  Gryffindor   Luna Lovegood     Ravenclaw
2      Harry Potter  Gryffindor       Cho Chang     Ravenclaw
3  Hermonie Granger  Gryffindor  Cedric Diggory    Hufflepuff
4     Ginny Weasley  Gryffindor  Cedric Diggory    Hufflepuff
5      Draco Malfoy   Slytherin    Harry Potter    Gryffindor
6     Luna Lovegood   Ravenclaw    Harry Potter    Gryffindor
7         Cho Chang   Ravenclaw    Harry Potter    Gryffindor
8         Cho Chang   Ravenclaw  Cedric Diggory    Hufflepuff
9    Cedric Diggory  Hufflepuff       Cho Chang     Ravenclaw

**8. We define a friendship as a relationship between two users where both follow each other. The friendship is established when the later of the two links is established.**

In [63]:
query = """
SELECT 
    f1.user_id AS user1_id,
    f2.user_id AS user2_id,
    MAX(f1.date, f2.date) AS friendship_date
FROM 
    follows f1
JOIN 
    follows f2
    ON f1.user_id = f2.follows AND f1.follows = f2.user_id
WHERE 
    f1.user_id < f2.user_id

"""

result =  pd.read_sql_query(query, conn_3)
print(result)

   user1_id  user2_id friendship_date
0         1         2      1993-09-01
1         2         3      1995-03-01
2         1         4      1994-04-02
3         1         5      2000-01-02
4         1         7      1996-10-01
5         1         8      1995-09-01
6         8         9      1996-01-10

In [64]:
query = """
SELECT 
    u1.first_name || ' ' || u1.last_name AS user1_id,
    u2.first_name || ' ' || u2.last_name AS user1_id,
    MAX(f1.date, f2.date) AS friendship_date
FROM 
    follows f1
JOIN 
    follows f2
    ON f1.user_id = f2.follows AND f1.follows = f2.user_id
JOIN
    users u1
    ON f1.user_id = u1.user_id
JOIN
    users u2
    ON f2.user_id = u2.user_id
WHERE 
    f1.user_id < f2.user_id

"""

result =  pd.read_sql_query(query, conn_3)
print(result)

       user1_id          user1_id friendship_date
0  Harry Potter        Ron Wesley      1993-09-01
1    Ron Wesley  Hermonie Granger      1995-03-01
2  Harry Potter     Ginny Weasley      1994-04-02
3  Harry Potter      Draco Malfoy      2000-01-02
4  Harry Potter     Luna Lovegood      1996-10-01
5  Harry Potter         Cho Chang      1995-09-01
6     Cho Chang    Cedric Diggory      1996-01-10

**9. List all unrequited followings (i.e. where A follows B but B does not follow A)**

In [66]:
query = """
SELECT 
    f1.user_id AS follower,
    u1.first_name || ' ' || u1.last_name AS follower_name,
    f1.follows AS followed,
    u2.first_name || ' ' || u2.last_name AS followed_name
FROM 
    follows f1
JOIN
    users u1
    ON f1.user_id = u1.user_id
JOIN
    users u2
    ON f1.follows = u2.user_id
LEFT JOIN 
    follows f2
    ON f1.user_id = f2.follows AND f1.follows = f2.user_id
WHERE 
    f2.user_id IS NULL

"""

result =  pd.read_sql_query(query, conn_3)
print(result)

   follower     follower_name  followed   followed_name
0         3  Hermonie Granger         1    Harry Potter
1         4     Ginny Weasley         2      Ron Wesley
2         5      Draco Malfoy         6      Tom Riddle
3         7     Luna Lovegood         8       Cho Chang
4         3  Hermonie Granger         9  Cedric Diggory
5         4     Ginny Weasley         9  Cedric Diggory

------

## 4. Orders

In [69]:
customers = pd.read_csv("04_orders/customers.csv")
order_details = pd.read_csv("04_orders/order_details.csv")
orders = pd.read_csv("04_orders/orders.csv")
products = pd.read_csv("04_orders/products.csv")

conn_4 = sqlite3.connect(":memory:")

customers.to_sql('customers', conn_4, index=False)
order_details.to_sql('order_details', conn_4, index=False)
orders.to_sql('orders', conn_4, index=False)
products.to_sql('products', conn_4, index=False)

150

**1. List the 10 most expensive products for sale, and their prices**

In [71]:
query = """
SELECT 
    *
FROM products
ORDER BY price DESC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   product_id                 product_name  price
0        8028  Incredible Granite Keyboard  115.0
1        8112    Ergonomic Concrete Cheese  114.0
2        8002       Ergonomic Granite Soap  113.0
3        8009            Generic Metal Hat  113.0
4        8035        Generic Concrete Soap  113.0
5        8091           Sleek Frozen Shirt  113.0
6        8134       Fantastic Steel Towels  113.0
7        8130             Small Metal Bike  112.0
8        8057          Awesome Metal Salad  111.0
9        8051     Handcrafted Frozen Pants  110.0

**2. Which states have more than 5 customers? Use the state column on the customer table. Count each customer on the table, regardless of whether they have ever bought anything.**

In [73]:
query = """
SELECT 
    state,
    COUNT(*) AS customers_state
FROM customers
GROUP BY state
HAVING customers_state > 5
ORDER BY customers_state DESC
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

  state  customers_state
0    AL                9
1    WY                8
2    WV                7
3    IL                7
4    MS                6
5    ME                6
6    FL                6

**3. Get the 17 customers that have made the largest number of orders. Include the name, address, state, and number of orders made**

In [75]:
query = """
SELECT 
    c.name AS Name,
    c.address AS address,
    c.state AS state,
    COUNT(o.order_id) AS num_orders
FROM customers AS c
JOIN orders AS o ON o.customer_id = c.user_id
GROUP BY c.user_id
ORDER BY num_orders DESC
LIMIT 17 
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

                 Name                         address state  num_orders
0        Joseph Ponce          93874 Esparza Mountain    KS          19
1      Andrew Fischer               7764 Brown Divide    ME          18
2      Sabrina Foster     5075 Mullins Drive Apt. 298    MD          17
3     George Davis MD                  439 Chan Route    IL          16
4      Benjamin Brown                 598 Moore Ports    TN          16
5     Michelle Austin                 856 Mills Lakes    MI          15
6     Kimberly Palmer    09293 Burnett Path Suite 681    NV          15
7         Beth Rivera   7813 Ingram Junction Apt. 318    AK          15
8   Johnathan Charles           22678 Hartman Mission    HI          15
9         Emily Fritz                918 Renee Lights    AL          15
10      Eric Erickson                 7751 Clark Lane    VA          15
11        Edgar Perry                333 Jenna Bridge    AL          15
12       Emily Nelson      56388 Rivera Neck Apt. 883    OK          15
13        Sarah Ortiz  8972 Rodriguez Vista Suite 102    AL          15
14      Jessica Burke               68160 Amanda Pike    NM          15
15     Crystal Hayden                 486 Traci Roads    WI          15
16    Michelle Wright       565 Manuel Road Suite 343    IN          15

**4. Get all orders by customer 1026. Include the amount spent in each order, the order id, and the total number of distinct products purchased.**

In [77]:
query = """
SELECT 
    o.order_id AS Order_ID,
    SUM(p.price * od.quantity)  AS Price,
    COUNT(DISTINCT(od.product_id)) AS num_distinct_product
FROM orders AS o
JOIN order_details AS od ON od.order_id = o.order_id
JOIN products AS p ON od.product_id = p.product_id
WHERE o.customer_id = 1026
GROUP BY o.order_id 
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   Order_ID   Price  num_distinct_product
0        59  1086.0                     5
1       274   912.0                     4
2       387   190.0                     1
3       622  1148.0                     2
4       844   870.0                     1
5      1795   317.0                     2
6      1992   285.0                     1

**5. Get the 10 customers that have spent the most. Give the customer_id and amount spent**

In [79]:
query = """
SELECT 
    c.user_id AS Customer_ID,
    SUM(od.quantity * p.price) AS Total_Spent
FROM customers AS c
JOIN orders AS o ON o.customer_id = c.user_id
JOIN order_details AS od ON od.order_id = o.order_id
JOIN products AS p ON p.product_id = od.product_id
GROUP BY c.user_id
ORDER BY Total_Spent DESC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   Customer_ID  Total_Spent
0         1087      22632.0
1         1178      21972.0
2         1013      20568.0
3         1139      19881.0
4         1153      19791.0
5         1106      19182.0
6         1140      18979.0
7         1042      18091.0
8         1190      17990.0
9         1029      17958.0

**6. Repeat the previous question, but include the customer's name, address, and state, in addition to the customer id and total amount spent**

In [81]:
query = """
SELECT 
    c.user_id AS Customer_ID,
    c.name AS Customer_Name,
    c.address AS Customer_Addres,
    c.state AS Customer_State,
    SUM(od.quantity * p.price) AS Total_Spent
FROM customers AS c
JOIN orders AS o ON o.customer_id = c.user_id
JOIN order_details AS od ON od.order_id = o.order_id
JOIN products AS p ON p.product_id = od.product_id
GROUP BY c.user_id
ORDER BY Total_Spent DESC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   Customer_ID       Customer_Name                Customer_Addres  \
0         1087     Allison Hoffman                  55218 Lam Key
1         1178  Jacqueline Frazier  85471 Davis Viaduct Suite 294
2         1013   Timothy Robertson    72067 Bridget Loaf Apt. 580
3         1139        Joseph Ponce         93874 Esparza Mountain
4         1153   Johnathan Charles          22678 Hartman Mission
5         1106      Andrew Fischer              7764 Brown Divide
6         1140      Jennifer Blake    9201 Andrea Courts Apt. 332
7         1042       Jessica Burke              68160 Amanda Pike
8         1190     Michelle Austin                856 Mills Lakes
9         1029         Jordan Rose                0537 Joel Ferry

  Customer_State  Total_Spent
0             KY      22632.0
1             AK      21972.0
2             PA      20568.0
3             KS      19881.0
4             HI      19791.0
5             ME      19182.0
6             MI      18979.0
7             NM      18091.0
8             MI      17990.0
9             MT      17958.0

**7. Find the 10 customers that spent the most in 2017. Give the name and amount spent. Take the date to be the order date (not the delivery date)**

In [83]:
query = """
SELECT 
    c.user_id AS Customer_ID,
    c.name AS Customer_Name,
    SUM(od.quantity * p.price) AS Amt_Spent
FROM customers AS c
JOIN orders AS o ON o.customer_id = c.user_id
JOIN order_details AS od ON od.order_id = o.order_id
JOIN products AS p ON p.product_id = od.product_id
WHERE STRFTIME('%Y', o.order_date ) = "2017"
GROUP BY c.user_id
ORDER BY Amt_Spent DESC
LIMIT 10
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   Customer_ID    Customer_Name  Amt_Spent
0         1120   Sabrina Foster    14986.0
1         1115     Emily Nelson    13480.0
2         1014    Timothy Marks    13266.0
3         1087  Allison Hoffman    11928.0
4         1181     Jeanne Casey    11789.0
5         1143       Dana Kline    11312.0
6         1103   Kristen Davies    11125.0
7         1106   Andrew Fischer    10659.0
8         1135      Emily Fritz    10628.0
9         1139     Joseph Ponce    10439.0

**8. Which three products have we sold the most of? i.e. the greatest number of units?**

In [85]:
query = """
SELECT 
    p.product_id ,
    p.product_name,
    SUM(od.quantity) AS Num_Sold
FROM products AS p
JOIN order_details AS od ON od.product_id = p.product_id
GROUP BY p.product_id
ORDER BY Num_Sold DESC
LIMIT 3
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   product_id             product_name  Num_Sold
0        8020  Ergonomic Concrete Bike       344
1        8070  Handmade Metal Sausages       315
2        8009        Generic Metal Hat       311

**9. What is the average number of days between order and delivery?**

In [87]:
query = """
SELECT 
    AVG(julianday(deliver_date) - julianday(order_date)) AS AVG_Days
FROM orders
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   AVG_Days
0    5.9085

**10. What is the average number of days between order and delivery for each year? Take the year from the order date.**

In [89]:
query = """
SELECT
    STRFTIME('%Y', order_date) AS Year,
    AVG(julianday(deliver_date) - julianday(order_date)) AS AVG_Days
FROM orders
GROUP BY Year
"""

result =  pd.read_sql_query(query, conn_4)
print(result)

   Year  AVG_Days
0  2016  5.800000
1  2017  5.878669
2  2018  5.969059

## 5. Election

In [91]:
candidate = pd.read_csv("05_election/candidate.csv")
election = pd.read_csv("05_election/election.csv")

conn_5 = sqlite3.connect(":memory:")

candidate.to_sql('candidate', conn_5, index=False)
election.to_sql('election', conn_5, index=False)

860

**1. How many candidates are in the candidate table for the 2000 election?**

In [93]:
query = """
SELECT
    candidate
FROM candidate
WHERE year = "2000"
"""

result =  pd.read_sql_query(query, conn_5)
print(result)

         candidate
0         Gore, Al
1     Nader, Ralph
2  Bush, George W.

**2. How many candidates are in the candidate table for each election from 1984 to 2016?**

In [95]:
query = """
SELECT
    year,
    COUNT(*)
FROM candidate
GROUP BY year
HAVING year >= "1984"
ORDER BY year ASC
"""

result =  pd.read_sql_query(query, conn_5)
print(result)

   year  COUNT(*)
0  1984         2
1  1988         2
2  1992         3
3  1996         3
4  2000         3
5  2004         2
6  2008         2
7  2012         2
8  2016         3

**3. For each election from 1984 to 2016, give the party that won the popular vote (i.e. the most votes, not the most electoral college seats)**

In [97]:
query = """
SELECT
    year,
    total_democrat,
    total_republican,
    total_other,
    CASE
        WHEN total_democrat > total_republican AND total_democrat > total_other THEN "DEMOCRAT"
        WHEN total_republican > total_democrat AND total_republican > total_other THEN "REPUBLICAN"
        ELSE "OTHER"
    END AS Winner
FROM (SELECT
        year,
        SUM(Democrat) AS total_democrat,
        SUM(Republican) AS total_republican,
        SUM(Other) AS total_other
        
    FROM election
    GROUP BY year
    HAVING year >= "1984"
    ORDER BY year ASC)
"""

result =  pd.read_sql_query(query, conn_5)
print(result)

   year  total_democrat  total_republican  total_other      Winner
0  1984        37577352          54455472            0  REPUBLICAN
1  1988        41809476          48886597            0  REPUBLICAN
2  1992        44909806          39104550     19743821    DEMOCRAT
3  1996        47400125          39198755      8085402    DEMOCRAT
4  2000        51009810          50462412      2883443    DEMOCRAT
5  2004        59027115          62039572            0  REPUBLICAN
6  2008        69499428          59950323            0    DEMOCRAT
7  2012        65918507          60934407            0    DEMOCRAT
8  2016        65853625          62985106      4489233    DEMOCRAT

**4. Extension of previous question: for each election from 1984 to 2016, give the party that won the popular vote and the margin (i.e. the amount that the winning party got over the party that came in second place). You can assume that the third party votes ("Other") are irrelevant, and just compare Democrats and Republicans.**

In [162]:
query = """
SELECT
    year,
    ABS(total_republican - total_democrat) AS Margin,
    CASE
        WHEN total_democrat > total_republican THEN "DEMOCRAT"
        ELSE "REPUBLICAN"
    END AS Winner
    
FROM (SELECT
        year,
        SUM(Democrat) AS total_democrat,
        SUM(Republican) AS total_republican
    FROM election
    GROUP BY year
    HAVING year >= "1984"
    ORDER BY year ASC)
GROUP BY year
"""

result =  pd.read_sql_query(query, conn_5)
print(result)

   year    Margin      Winner
0  1984  16878120  REPUBLICAN
1  1988   7077121  REPUBLICAN
2  1992   5805256    DEMOCRAT
3  1996   8201370    DEMOCRAT
4  2000    547398    DEMOCRAT
5  2004   3012457  REPUBLICAN
6  2008   9549105    DEMOCRAT
7  2012   4984100    DEMOCRAT
8  2016   2868519    DEMOCRAT

**5. Which states have had fewer than 3 democratic victories (i.e. fewer than 3 elections where the democrats got the majority of the votes in that state) since 1952?**

In [215]:
query = """
SELECT
    State,
    count(Winner) AS num_democratic_victories
FROM (SELECT
    State,
    CASE
        WHEN Democrat > Republican THEN "DEMO"
        ELSE "REPU"
    END AS Winner
    FROM election)
WHERE Winner LIKE "DEMO"
GROUP BY State
HAVING num_democratic_victories < 3


"""

result =  pd.read_sql_query(query, conn_5)
print(result)

   State  num_democratic_victories
0     AK                         1
1     AZ                         1
2     ID                         1
3     IN                         2
4     KS                         1
5     MT                         2
6     ND                         1
7     NE                         1
8     OK                         1
9     SD                         1
10    UT                         1
11    WY                         1

**6. Which states have had fewer than 3 republican victories since 1952?**

In [225]:
query = """
SELECT
    State,
    count(Winner) AS num_democratic_victories
FROM (SELECT
    State,
    CASE
        WHEN Democrat > Republican THEN "DEMO"
        ELSE "REPU"
    END AS Winner
    FROM election)
WHERE Winner LIKE "REPU"
GROUP BY State
HAVING num_democratic_victories < 3 OR num_democratic_victories IS NULL


"""

result =  pd.read_sql_query(query, conn_5)
print(result)

  State  num_democratic_victories
0    HI                         2

**7. We are interested in measuring the partisanship of the states. We will define a partisan state as one that is consistently won by a single party (either Democrat or Republican) since 1988. For example, since 1988 California has been won by the republicans once, and won by the democrats 7 times. Under this metric, California would be considered "partisan". (Note that if we include elections back to 1952, the republicans have won CA 9 times, and democrats have only won it 8 times).**

**Find the states where all of the elections since 1988 (including 1988) have been won by the same party**

In [253]:
query = """
SELECT
    State,
    CASE
        WHEN Total_Dem = 8 THEN "Demo"
        WHEN Total_Rep = 8 THEN "Rep"
        END AS Winner
FROM (SELECT
        State,
        SUM(CASE WHEN Democrat > Republican THEN 1 END) AS Total_Dem,
        SUM(CASE WHEN Republican > Democrat THEN 1 END)  AS Total_Rep
    FROM election
    WHERE Year >= "1988"
    GROUP BY State)
WHERE Winner IS NOT Null



"""

result =  pd.read_sql_query(query, conn_5)
print(result)

   State Winner
0     AK    Rep
1     AL    Rep
2     DC   Demo
3     HI   Demo
4     ID    Rep
5     KS    Rep
6     MA   Demo
7     MN   Demo
8     MS    Rep
9     ND    Rep
10    NE    Rep
11    NY   Demo
12    OK    Rep
13    OR   Demo
14    RI   Demo
15    SC    Rep
16    SD    Rep
17    TX    Rep
18    UT    Rep
19    WA   Demo
20    WY    Rep